node {
  name: "global_step"
  op: "Variable"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_step/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step/Assign"
  op: "Assign"
  input: "global_step"
  input: "global_step/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_step/read"
  op: "Identity"
  input: "global_step"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "batch_processing/filename_queue/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 128
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 128
          }
        }
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00000-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00001-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00002-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00003-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00004-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00005-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00006-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00007-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00008-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00009-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00010-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00011-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00012-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00013-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00014-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00015-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00016-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00017-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00018-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00019-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00020-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00021-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00022-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00023-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00024-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00025-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00026-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00027-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00028-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00029-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00030-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00031-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00032-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00033-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00034-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00035-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00036-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00037-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00038-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00039-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00040-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00041-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00042-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00043-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00044-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00045-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00046-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00047-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00048-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00049-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00050-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00051-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00052-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00053-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00054-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00055-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00056-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00057-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00058-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00059-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00060-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00061-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00062-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00063-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00064-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00065-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00066-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00067-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00068-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00069-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00070-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00071-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00072-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00073-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00074-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00075-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00076-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00077-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00078-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00079-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00080-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00081-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00082-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00083-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00084-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00085-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00086-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00087-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00088-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00089-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00090-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00091-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00092-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00093-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00094-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00095-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00096-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00097-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00098-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00099-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00100-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00101-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00102-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00103-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00104-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00105-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00106-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00107-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00108-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00109-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00110-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00111-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00112-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00113-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00114-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00115-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00116-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00117-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00118-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00119-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00120-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00121-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00122-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00123-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00124-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00125-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00126-of-00128"
        string_val: "/data/imagenet-2012/imagenet-with-bbox-validation-00127-of-00128"
      }
    }
  }
}
node {
  name: "batch_processing/filename_queue/Size"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 128
      }
    }
  }
}
node {
  name: "batch_processing/filename_queue/Greater/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "batch_processing/filename_queue/Greater"
  op: "Greater"
  input: "batch_processing/filename_queue/Size"
  input: "batch_processing/filename_queue/Greater/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "batch_processing/filename_queue/Assert/data_0"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "string_input_producer requires a non-null input tensor"
      }
    }
  }
}
node {
  name: "batch_processing/filename_queue/Assert"
  op: "Assert"
  input: "batch_processing/filename_queue/Greater"
  input: "batch_processing/filename_queue/Assert/data_0"
  attr {
    key: "T"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "summarize"
    value {
      i: 3
    }
  }
}
node {
  name: "batch_processing/filename_queue/Identity"
  op: "Identity"
  input: "batch_processing/filename_queue/Const"
  input: "^batch_processing/filename_queue/Assert"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 128
          }
        }
      }
    }
  }
}
node {
  name: "batch_processing/filename_queue"
  op: "FIFOQueue"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "capacity"
    value {
      i: 1
    }
  }
  attr {
    key: "component_types"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "batch_processing/filename_queue/filename_queue_EnqueueMany"
  op: "QueueEnqueueMany"
  input: "batch_processing/filename_queue"
  input: "batch_processing/filename_queue/Identity"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_processing/filename_queue"
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "batch_processing/filename_queue/filename_queue_Close"
  op: "QueueClose"
  input: "batch_processing/filename_queue"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_processing/filename_queue"
      }
    }
  }
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: false
    }
  }
}
node {
  name: "batch_processing/filename_queue/filename_queue_Close_1"
  op: "QueueClose"
  input: "batch_processing/filename_queue"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_processing/filename_queue"
      }
    }
  }
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: true
    }
  }
}
node {
  name: "batch_processing/filename_queue/filename_queue_Size"
  op: "QueueSize"
  input: "batch_processing/filename_queue"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_processing/filename_queue"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "batch_processing/filename_queue/Cast"
  op: "Cast"
  input: "batch_processing/filename_queue/filename_queue_Size"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "batch_processing/filename_queue/mul/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "batch_processing/filename_queue/mul"
  op: "Mul"
  input: "batch_processing/filename_queue/Cast"
  input: "batch_processing/filename_queue/mul/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "batch_processing/filename_queue/ScalarSummary/tags"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "queue/batch_processing/filename_queue/fraction_of_1_full"
      }
    }
  }
}
node {
  name: "batch_processing/filename_queue/ScalarSummary"
  op: "ScalarSummary"
  input: "batch_processing/filename_queue/ScalarSummary/tags"
  input: "batch_processing/filename_queue/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "batch_processing/fifo_examples_queue"
  op: "FIFOQueue"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "capacity"
    value {
      i: 1124
    }
  }
  attr {
    key: "component_types"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shapes"
    value {
      list {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "batch_processing/fifo_examples_queue_Size"
  op: "QueueSize"
  input: "batch_processing/fifo_examples_queue"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_processing/fifo_examples_queue"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "batch_processing/ToFloat"
  op: "Cast"
  input: "batch_processing/fifo_examples_queue_Size"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "batch_processing/mul/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.000889679708052
      }
    }
  }
}
node {
  name: "batch_processing/mul"
  op: "Mul"
  input: "batch_processing/ToFloat"
  input: "batch_processing/mul/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "batch_processing/ScalarSummary/tags"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "queue/batch_processing/fifo_examples_queue/fraction_of_1124_full"
      }
    }
  }
}
node {
  name: "batch_processing/ScalarSummary"
  op: "ScalarSummary"
  input: "batch_processing/ScalarSummary/tags"
  input: "batch_processing/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "batch_processing/SSTableReader"
  op: "SSTableReader"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "key_prefix"
    value {
      s: ""
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "batch_processing/ReaderRead"
  op: "ReaderRead"
  input: "batch_processing/SSTableReader"
  input: "batch_processing/filename_queue"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_processing/SSTableReader"
        s: "loc:@batch_processing/filename_queue"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "batch_processing/ParseSingleExample/ExpandDims/dim"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "batch_processing/ParseSingleExample/ExpandDims"
  op: "ExpandDims"
  input: "batch_processing/ReaderRead:1"
  input: "batch_processing/ParseSingleExample/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "batch_processing/ParseSingleExample/ParseExample/key_image/class/label"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: -1
      }
    }
  }
}
node {
  name: "batch_processing/ParseSingleExample/ParseExample/Reshape/shape"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "batch_processing/ParseSingleExample/ParseExample/Reshape"
  op: "Reshape"
  input: "batch_processing/ParseSingleExample/ParseExample/key_image/class/label"
  input: "batch_processing/ParseSingleExample/ParseExample/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "batch_processing/ParseSingleExample/ParseExample/key_image/class/text"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: ""
      }
    }
  }
}
node {
  name: "batch_processing/ParseSingleExample/ParseExample/Reshape_1/shape"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "batch_processing/ParseSingleExample/ParseExample/Reshape_1"
  op: "Reshape"
  input: "batch_processing/ParseSingleExample/ParseExample/key_image/class/text"
  input: "batch_processing/ParseSingleExample/ParseExample/Reshape_1/shape"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "batch_processing/ParseSingleExample/ParseExample/key_image/encoded"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: ""
      }
    }
  }
}
node {
  name: "batch_processing/ParseSingleExample/ParseExample/Reshape_2/shape"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "batch_processing/ParseSingleExample/ParseExample/Reshape_2"
  op: "Reshape"
  input: "batch_processing/ParseSingleExample/ParseExample/key_image/encoded"
  input: "batch_processing/ParseSingleExample/ParseExample/Reshape_2/shape"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "batch_processing/ParseSingleExample/ParseExample/ParseExample/names"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "batch_processing/ParseSingleExample/ParseExample/ParseExample/sparse_keys_0"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "image/object/bbox/xmax"
      }
    }
  }
}
node {
  name: "batch_processing/ParseSingleExample/ParseExample/ParseExample/sparse_keys_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "image/object/bbox/xmin"
      }
    }
  }
}
node {
  name: "batch_processing/ParseSingleExample/ParseExample/ParseExample/sparse_keys_2"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "image/object/bbox/ymax"
      }
    }
  }
}
node {
  name: "batch_processing/ParseSingleExample/ParseExample/ParseExample/sparse_keys_3"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "image/object/bbox/ymin"
      }
    }
  }
}
node {
  name: "batch_processing/ParseSingleExample/ParseExample/ParseExample/dense_keys_0"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "image/class/label"
      }
    }
  }
}
node {
  name: "batch_processing/ParseSingleExample/ParseExample/ParseExample/dense_keys_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "image/class/text"
      }
    }
  }
}
node {
  name: "batch_processing/ParseSingleExample/ParseExample/ParseExample/dense_keys_2"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "image/encoded"
      }
    }
  }
}
node {
  name: "batch_processing/ParseSingleExample/ParseExample/ParseExample"
  op: "ParseExample"
  input: "batch_processing/ParseSingleExample/ExpandDims"
  input: "batch_processing/ParseSingleExample/ParseExample/ParseExample/names"
  input: "batch_processing/ParseSingleExample/ParseExample/ParseExample/sparse_keys_0"
  input: "batch_processing/ParseSingleExample/ParseExample/ParseExample/sparse_keys_1"
  input: "batch_processing/ParseSingleExample/ParseExample/ParseExample/sparse_keys_2"
  input: "batch_processing/ParseSingleExample/ParseExample/ParseExample/sparse_keys_3"
  input: "batch_processing/ParseSingleExample/ParseExample/ParseExample/dense_keys_0"
  input: "batch_processing/ParseSingleExample/ParseExample/ParseExample/dense_keys_1"
  input: "batch_processing/ParseSingleExample/ParseExample/ParseExample/dense_keys_2"
  input: "batch_processing/ParseSingleExample/ParseExample/Reshape"
  input: "batch_processing/ParseSingleExample/ParseExample/Reshape_1"
  input: "batch_processing/ParseSingleExample/ParseExample/Reshape_2"
  attr {
    key: "Ndense"
    value {
      i: 3
    }
  }
  attr {
    key: "Nsparse"
    value {
      i: 4
    }
  }
  attr {
    key: "Tdense"
    value {
      list {
        type: DT_INT64
        type: DT_STRING
        type: DT_STRING
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 2
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 2
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 2
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 2
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: 2
          }
        }
        shape {
          dim {
            size: 2
          }
        }
        shape {
          dim {
            size: 2
          }
        }
        shape {
          dim {
            size: 2
          }
        }
        shape {
          dim {
            size: 1
          }
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dense_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
        shape {
        }
        shape {
        }
      }
    }
  }
  attr {
    key: "sparse_types"
    value {
      list {
        type: DT_FLOAT
        type: DT_FLOAT
        type: DT_FLOAT
        type: DT_FLOAT
      }
    }
  }
}
node {
  name: "batch_processing/ParseSingleExample/Squeeze_image/class/label"
  op: "Squeeze"
  input: "batch_processing/ParseSingleExample/ParseExample/ParseExample:12"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
        i: 0
      }
    }
  }
}
node {
  name: "batch_processing/ParseSingleExample/Squeeze_image/class/text"
  op: "Squeeze"
  input: "batch_processing/ParseSingleExample/ParseExample/ParseExample:13"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
        i: 0
      }
    }
  }
}
node {
  name: "batch_processing/ParseSingleExample/Squeeze_image/encoded"
  op: "Squeeze"
  input: "batch_processing/ParseSingleExample/ParseExample/ParseExample:14"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
        i: 0
      }
    }
  }
}
node {
  name: "batch_processing/ParseSingleExample/Slice_Indices_image/object/bbox/xmax/begin"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "batch_processing/ParseSingleExample/Slice_Indices_image/object/bbox/xmax/size"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\377\377\377\377\377\377\377\377"
      }
    }
  }
}
node {
  name: "batch_processing/ParseSingleExample/Slice_Indices_image/object/bbox/xmax"
  op: "Slice"
  input: "batch_processing/ParseSingleExample/ParseExample/ParseExample"
  input: "batch_processing/ParseSingleExample/Slice_Indices_image/object/bbox/xmax/begin"
  input: "batch_processing/ParseSingleExample/Slice_Indices_image/object/bbox/xmax/size"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "batch_processing/ParseSingleExample/Squeeze_Shape_image/object/bbox/xmax/begin"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "batch_processing/ParseSingleExample/Squeeze_Shape_image/object/bbox/xmax/size"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "batch_processing/ParseSingleExample/Squeeze_Shape_image/object/bbox/xmax"
  op: "Slice"
  input: "batch_processing/ParseSingleExample/ParseExample/ParseExample:8"
  input: "batch_processing/ParseSingleExample/Squeeze_Shape_image/object/bbox/xmax/begin"
  input: "batch_processing/ParseSingleExample/Squeeze_Shape_image/object/bbox/xmax/size"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "batch_processing/ParseSingleExample/Slice_Indices_image/object/bbox/xmin/begin"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "batch_processing/ParseSingleExample/Slice_Indices_image/object/bbox/xmin/size"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\377\377\377\377\377\377\377\377"
      }
    }
  }
}
node {
  name: "batch_processing/ParseSingleExample/Slice_Indices_image/object/bbox/xmin"
  op: "Slice"
  input: "batch_processing/ParseSingleExample/ParseExample/ParseExample:1"
  input: "batch_processing/ParseSingleExample/Slice_Indices_image/object/bbox/xmin/begin"
  input: "batch_processing/ParseSingleExample/Slice_Indices_image/object/bbox/xmin/size"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "batch_processing/ParseSingleExample/Squeeze_Shape_image/object/bbox/xmin/begin"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "batch_processing/ParseSingleExample/Squeeze_Shape_image/object/bbox/xmin/size"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "batch_processing/ParseSingleExample/Squeeze_Shape_image/object/bbox/xmin"
  op: "Slice"
  input: "batch_processing/ParseSingleExample/ParseExample/ParseExample:9"
  input: "batch_processing/ParseSingleExample/Squeeze_Shape_image/object/bbox/xmin/begin"
  input: "batch_processing/ParseSingleExample/Squeeze_Shape_image/object/bbox/xmin/size"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "batch_processing/ParseSingleExample/Slice_Indices_image/object/bbox/ymax/begin"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "batch_processing/ParseSingleExample/Slice_Indices_image/object/bbox/ymax/size"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\377\377\377\377\377\377\377\377"
      }
    }
  }
}
node {
  name: "batch_processing/ParseSingleExample/Slice_Indices_image/object/bbox/ymax"
  op: "Slice"
  input: "batch_processing/ParseSingleExample/ParseExample/ParseExample:2"
  input: "batch_processing/ParseSingleExample/Slice_Indices_image/object/bbox/ymax/begin"
  input: "batch_processing/ParseSingleExample/Slice_Indices_image/object/bbox/ymax/size"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "batch_processing/ParseSingleExample/Squeeze_Shape_image/object/bbox/ymax/begin"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "batch_processing/ParseSingleExample/Squeeze_Shape_image/object/bbox/ymax/size"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "batch_processing/ParseSingleExample/Squeeze_Shape_image/object/bbox/ymax"
  op: "Slice"
  input: "batch_processing/ParseSingleExample/ParseExample/ParseExample:10"
  input: "batch_processing/ParseSingleExample/Squeeze_Shape_image/object/bbox/ymax/begin"
  input: "batch_processing/ParseSingleExample/Squeeze_Shape_image/object/bbox/ymax/size"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "batch_processing/ParseSingleExample/Slice_Indices_image/object/bbox/ymin/begin"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "batch_processing/ParseSingleExample/Slice_Indices_image/object/bbox/ymin/size"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\377\377\377\377\377\377\377\377"
      }
    }
  }
}
node {
  name: "batch_processing/ParseSingleExample/Slice_Indices_image/object/bbox/ymin"
  op: "Slice"
  input: "batch_processing/ParseSingleExample/ParseExample/ParseExample:3"
  input: "batch_processing/ParseSingleExample/Slice_Indices_image/object/bbox/ymin/begin"
  input: "batch_processing/ParseSingleExample/Slice_Indices_image/object/bbox/ymin/size"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "batch_processing/ParseSingleExample/Squeeze_Shape_image/object/bbox/ymin/begin"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "batch_processing/ParseSingleExample/Squeeze_Shape_image/object/bbox/ymin/size"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "batch_processing/ParseSingleExample/Squeeze_Shape_image/object/bbox/ymin"
  op: "Slice"
  input: "batch_processing/ParseSingleExample/ParseExample/ParseExample:11"
  input: "batch_processing/ParseSingleExample/Squeeze_Shape_image/object/bbox/ymin/begin"
